#pragma once
#include "SkillsAwardList.h"
#include "gesture/FitnessFilter.h"
#include "hamobj/HamMove.h"
#include "hamobj/HamNavProvider.h"
#include "meta_ham/HamSongMgr.h"
#include "meta_ham/Instarank.h"
#include "net_ham/RockCentral.h"
#include "obj/Object.h"
#include "os/DateTime.h"

class MetaPerformer : public virtual Hmx::Object {
public:
    MetaPerformer(const HamSongMgr &, const char *);
    virtual ~MetaPerformer();
    virtual DataNode Handle(DataArray *, bool);
    // MetaPerformer
    virtual bool IsWinning() const = 0;
    virtual void Clear();
    virtual void ResetSongs();
    virtual void SelectSong(Symbol, int) = 0;
    virtual void CompleteSong(int, int, int, float, bool);
    virtual void AdvanceSong(int);
    virtual bool HasInstarankData() { return unk24; }
    virtual Instarank *GetInstarank() { return unk24; }
    virtual void OnLoadSong() {}

    Symbol GetSong() const;
    bool IsLastSong() const;
    bool IsSetComplete() const;
    void Restart();
    void TriggerSongCompletion(int, float);
    void JumpGameplayTimerForward(int);
    int GetMovesPassed(int);
    bool IsDifficultyUnlocked(Symbol) const;
    void CalculatePracticeResults();
    Symbol GetCrewVenue(Symbol) const;
    bool IsCrewAvailable(Symbol) const;
    bool IsPlaylistEmpty() const;
    bool IsPlaylistPlayable() const;
    bool IsPlaylistCustom() const;
    void SetPlaylist(Symbol);
    void SetDefaultCrews(Symbol);
    void StartPlaylist();
    void ContinuePlaylist();
    void ShufflePlaylist();
    void RepeatCurrentPlaylistSong();
    void UpdateSongFromPlaylist();
    void UpdateIsLastSong();
    int GetNumSongsInPlaylist() const;
    void SetPlaylistIndex(int);
    String GetPlaylistElapsedTimeString() const;
    void PopulatePlaylistSongProvider(HamNavProvider *) const;
    String GetPlaylistNameAndDuration() const;
    void GenerateRecommendedPracticeMoves(int);
    void SendOmgDatapoint(int, int);
    void SendDropInDatapoint(int);
    void SendDropOutDatapoint(int);
    void HandleSkippedSong();
    void HandleSongRestart();
    bool IsGameplayTimerRunning() const;
    void SetPlayedLongIntro(Symbol);
    bool GetPlayedLongIntro(Symbol);
    void SetDefaultCrews();
    bool HasRecommendedPracticeMoves() const;

    bool HasPlaylist() const { return unkbc; }

    static void SendSpeechDatapoint(DataArray *, float, Symbol);

private:
    static bool sCheatFinale;

protected:
    virtual void OnMovePassed(int, HamMove *, int, float);

    void OnGameInit();
    void OnFreestylePictureTaken();
    void OnPracticeMovePassed(int, const char *, SkillsAward, bool);
    void OnReviewMovePassed(int, HamMove *, int, float);
    void OnRecallMovePassed(int, HamMove *);
    void GetEraInvalid();

    DataNode OnMsg(const RCJobCompleteMsg &);

    int mEnrollmentIndex[2]; // 0x8
    std::vector<int> mNumCompleted; // 0x10
    int mNumRestarts; // 0x1c
    const HamSongMgr &mSongMgr; // 0x20
    Instarank *unk24; // 0x24
    bool mNoFail; // 0x28
    DateTime unk29; // 0x29
    bool mGotNewHighScore; // 0x2f
    bool unk30; // 0x30
    bool mGotNewBestStars; // 0x31
    bool unk32; // 0x32
    bool mGotMovesPassedBest; // 0x33
    bool mUnlockedNoFlashcards; // 0x34
    bool mCompletedSongWithNoFlashcards; // 0x35
    bool mUnlockedMediumDifficulty; // 0x36
    bool mUnlockedExpertDifficulty; // 0x37
    int unk38; // 0x38
    int unk3c; // 0x3c
    std::vector<HamMoveScore> unk40[2];
    int mMovesAttempted[2]; // 0x58
    Symbol mLastPlayedMode; // 0x60
    std::vector<String> mRecommendedPracticeMoves; // 0x64
    SkillsAwardList *mSkillsAwards; // 0x70
    std::vector<std::vector<bool> > unk74;
    int mNumLearnMovesPassed; // 0x80
    int mNumLearnMovesFastLaned; // 0x84
    int mNumLearnMovesTotal; // 0x88
    int mPracticeLearnScore; // 0x8c
    int mNumReviewMovesPassed; // 0x90
    int mNumReviewMovesTotal; // 0x94
    int mPracticeReviewScore; // 0x98
    int mPracticeOverallScore; // 0x9c
    bool mMoveScored; // 0xa0
    bool mCheckMoveScored; // 0xa1
    std::set<Symbol> mLongIntrosPlayed; // 0xa4
    int unkbc;
    std::set<int> mSkippedSongs; // 0xc0
    int mPlaylistIndex; // 0xd8
    int mPlaylistElapsedTime; // 0xdc
    bool unke0; // 0xe0
    bool mJustBeatGame; // 0xe1
    bool mSkipPracticeWelcome; // 0xe2
    bool unke3; // 0xe3
    FitnessFilter unke4[2];
};
