#pragma once
#include "minwinbase.h"
#include "../win_types.h"

#ifdef __cplusplus
extern "C" {
#endif

typedef enum _XBACKGROUND_DOWNLOAD_MODE {
    XBACKGROUND_DOWNLOAD_MODE_ALWAYS_ALLOW = 0x0001,
    XBACKGROUND_DOWNLOAD_MODE_AUTO = 0x0002,
} XBACKGROUND_DOWNLOAD_MODE;

enum XC_LANGUAGE {
    XC_LANGUAGE_UNKNOWN = 0,
    XC_LANGUAGE_ENGLISH = 1,
    XC_LANGUAGE_JAPANESE = 2,
    XC_LANGUAGE_GERMAN = 3,
    XC_LANGUAGE_FRENCH = 4,
    XC_LANGUAGE_SPANISH = 5,
    XC_LANGUAGE_ITALIAN = 6,
    XC_LANGUAGE_KOREAN = 7,
    XC_LANGUAGE_TCHINESE = 8,
    XC_LANGUAGE_PORTUGUESE = 9,
    XC_LANGUAGE_SCHINESE = 10,
    XC_LANGUAGE_POLISH = 11,
    XC_LANGUAGE_RUSSIAN = 12
};

enum XC_LOCALE {
    XC_LOCALE_UNKNOWN = 0,
    XC_LOCALE_AUSTRALIA = 1,
    XC_LOCALE_AUSTRIA = 2,
    XC_LOCALE_BELGIUM = 3,
    XC_LOCALE_BRAZIL = 4,
    XC_LOCALE_CANADA = 5,
    XC_LOCALE_CHILE = 6,
    XC_LOCALE_CHINA = 7,
    XC_LOCALE_COLOMBIA = 8,
    XC_LOCALE_CZECH_REPUBLIC = 9,
    XC_LOCALE_DENMARK = 10,
    XC_LOCALE_FINLAND = 11,
    XC_LOCALE_FRANCE = 12,
    XC_LOCALE_GERMANY = 13,
    XC_LOCALE_GREECE = 14,
    XC_LOCALE_HONG_KONG = 15,
    XC_LOCALE_HUNGARY = 16,
    XC_LOCALE_INDIA = 17,
    XC_LOCALE_IRELAND = 18,
    XC_LOCALE_ITALY = 19,
    XC_LOCALE_JAPAN = 20,
    XC_LOCALE_KOREA = 21,
    XC_LOCALE_MEXICO = 22,
    XC_LOCALE_NETHERLANDS = 23,
    XC_LOCALE_NEW_ZEALAND = 24,
    XC_LOCALE_NORWAY = 25,
    XC_LOCALE_POLAND = 26,
    XC_LOCALE_PORTUGAL = 27,
    XC_LOCALE_SINGAPORE = 28,
    XC_LOCALE_SLOVAK_REPUBLIC = 29,
    XC_LOCALE_SOUTH_AFRICA = 30,
    XC_LOCALE_SPAIN = 31,
    XC_LOCALE_SWEDEN = 32,
    XC_LOCALE_SWITZERLAND = 33,
    XC_LOCALE_TAIWAN = 34,
    XC_LOCALE_GREAT_BRITAIN = 35,
    XC_LOCALE_UNITED_STATES = 36,
    XC_LOCALE_RUSSIAN_FEDERATION = 37
};

enum XAUDIO2_FILTER_TYPE {
    LowPassFilter = 0x0000,
    BandPassFilter = 0x0001,
    HighPassFilter = 0x0002,
    NotchFilter = 0x0003,
};

struct XUSER_ACHIEVEMENT { /* Size=0x8 */
    /* 0x0000 */ DWORD dwUserIndex;
    /* 0x0004 */ DWORD dwAchievementId;
};

typedef VOID XOVERLAPPED_COMPLETION_ROUTINE(DWORD, DWORD, struct _XOVERLAPPED *);

typedef struct _XOVERLAPPED { /* Size=0x1c */
    ULONG_PTR InternalLow;
    ULONG_PTR InternalHigh;
    ULONG_PTR InternalContext;
    HANDLE hEvent;
    XOVERLAPPED_COMPLETION_ROUTINE *pCompletionRoutine;
    DWORD_PTR dwCompletionContext;
    DWORD dwExtendedError;
} XOVERLAPPED;

typedef enum _XPRIVILEGE_TYPE {
    XPRIVILEGE_MULTIPLAYER_SESSIONS = 0x00fe,
    XPRIVILEGE_COMMUNICATIONS = 0x00fc,
    XPRIVILEGE_COMMUNICATIONS_FRIENDS_ONLY = 0x00fb,
    XPRIVILEGE_PROFILE_VIEWING = 0x00f9,
    XPRIVILEGE_PROFILE_VIEWING_FRIENDS_ONLY = 0x00f8,
    XPRIVILEGE_USER_CREATED_CONTENT = 0x00f7,
    XPRIVILEGE_USER_CREATED_CONTENT_FRIENDS_ONLY = 0x00f6,
    XPRIVILEGE_PURCHASE_CONTENT = 0x00f5,
    XPRIVILEGE_PRESENCE = 0x00f4,
    XPRIVILEGE_PRESENCE_FRIENDS_ONLY = 0x00f3,
    XPRIVILEGE_TRADE_CONTENT = 0x00ee,
    XPRIVILEGE_VIDEO_COMMUNICATIONS = 0x00eb,
    XPRIVILEGE_VIDEO_COMMUNICATIONS_FRIENDS_ONLY = 0x00ea,
    XPRIVILEGE_SOCIAL_NETWORK_SHARING = 0x00dc,
    XPRIVILEGE_CONTENT_AUTHOR = 0x00de,
    XPRIVILEGE_UNSAFE_PROGRAMMING = 0x00d4,
    XPRIVILEGE_SHARE_CONTENT_OUTSIDE_LIVE = 0x00d3,
    XPRIVILEGE_INTERNET_BROWSING = 0x00d9,
} XPRIVILEGE_TYPE;

typedef enum _XUSER_SIGNIN_STATE {
    eXUserSigninState_NotSignedIn = 0x0000,
    eXUserSigninState_SignedInLocally = 0x0001,
    eXUserSigninState_SignedInToLive = 0x0002,
} XUSER_SIGNIN_STATE;

typedef unsigned long long XUID;

typedef struct _XDEVICE_DATA { /* Size=0x50 */
    /* 0x0000 */ DWORD DeviceID;
    /* 0x0004 */ DWORD DeviceType;
    /* 0x0008 */ ULONGLONG ulDeviceBytes;
    /* 0x0010 */ ULONGLONG ulDeviceFreeBytes;
    /* 0x0018 */ WCHAR wszFriendlyName[27];
} XDEVICE_DATA, *PXDEVICE_DATA;

#define XCONTENT_MAX_FILENAME_LENGTH 42
#define XCONTENT_MAX_DISPLAYNAME_LENGTH 128

typedef struct _XCONTENT_DATA { /* Size=0x134 */
    /* 0x0000 */ DWORD DeviceID;
    /* 0x0004 */ DWORD dwContentType;
    /* 0x0008 */ WCHAR szDisplayName[XCONTENT_MAX_DISPLAYNAME_LENGTH];
    /* 0x0108 */ CHAR szFileName[XCONTENT_MAX_FILENAME_LENGTH];
} XCONTENT_DATA;

typedef struct _XCONTENT_CROSS_TITLE_DATA { /* Size=0x138 */
    /* 0x0000 */ DWORD DeviceID;
    /* 0x0004 */ DWORD dwContentType;
    /* 0x0008 */ WCHAR szDisplayName[XCONTENT_MAX_DISPLAYNAME_LENGTH];
    /* 0x0108 */ CHAR szFileName[XCONTENT_MAX_FILENAME_LENGTH];
    /* 0x0134 */ DWORD dwTitleId;
} XCONTENT_CROSS_TITLE_DATA;

typedef struct _XUSER_SIGNIN_INFO { /* Size=0x28 */
    XUID xuid; // 0x0
    DWORD dwInfoFlags; // 0x8
    XUSER_SIGNIN_STATE UserSigninState; // 0xc
    DWORD dwGuestNumber; // 0x10
    DWORD dwSponsorUserIndex; // 0x14
    char szUserName[16]; // 0x18
} XUSER_SIGNIN_INFO;

typedef enum _XCONTENTDEVICEID {
    XCONTENTDEVICE_ANY = 0
    // fill in others as you find them out
} XCONTENTDEVICEID;

typedef struct _XVIDEO_MODE { /* Size=0x30 */
    /* 0x0000 */ DWORD dwDisplayWidth;
    /* 0x0004 */ DWORD dwDisplayHeight;
    /* 0x0008 */ BOOL fIsInterlaced;
    /* 0x000c */ BOOL fIsWideScreen;
    /* 0x0010 */ BOOL fIsHiDef;
    /* 0x0014 */ float RefreshRate;
    /* 0x0018 */ DWORD VideoStandard;
    /* 0x001c */ DWORD Reserved[5];
} XVIDEO_MODE;

struct XUSER_AVATARASSET { /* Size=0x8 */
    /* 0x0000 */ DWORD dwUserIndex;
    /* 0x0004 */ DWORD dwAwardId;
};

typedef struct _XUSER_DATA { /* Size=0x10 */
    /* 0x0000 */ BYTE type;
    union {
        /* 0x0008 */ LONG nData;
        /* 0x0008 */ LONGLONG i64Data;
        /* 0x0008 */ double dblData;
        /* 0x0008 */ struct {
            DWORD cbData;
            LPWSTR *pwszData;
        } string;
        /* 0x0008 */ float fData;
        /* 0x0008 */ struct {
            DWORD cbData;
            BYTE *pbData;
        } binary;
        /* 0x0008 */ FILETIME ftData;
    };
} XUSER_DATA;

typedef struct _XUSER_PROPERTY { /* Size=0x18 */
    /* 0x0000 */ DWORD dwPropertyId;
    /* 0x0008 */ XUSER_DATA value;
} XUSER_PROPERTY;

typedef enum _XSHOWMARKETPLACEUI_ENTRYPOINTS {
    XSHOWMARKETPLACEUI_ENTRYPOINT_CONTENTLIST = 0x0000,
    XSHOWMARKETPLACEUI_ENTRYPOINT_CONTENTITEM = 0x0001,
    XSHOWMARKETPLACEUI_ENTRYPOINT_MEMBERSHIPLIST = 0x0002,
    XSHOWMARKETPLACEUI_ENTRYPOINT_MEMBERSHIPITEM = 0x0003,
    XSHOWMARKETPLACEUI_ENTRYPOINT_CONTENTLIST_BACKGROUND = 0x0004,
    XSHOWMARKETPLACEUI_ENTRYPOINT_CONTENTITEM_BACKGROUND = 0x0005,
    XSHOWMARKETPLACEUI_ENTRYPOINT_MAX = 0x0006,
} XSHOWMARKETPLACEUI_ENTRYPOINTS;

typedef enum _XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINTS {
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_ADDPOINTS = 0x0006,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_PREPAIDCODE = 0x0007,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_FNC = 0x0008,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_GAMERTAGPURCHASE = 0x0009,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_SIGNUP_CREDITCARD = 0x000a,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_SIGNUP_PARENTCREDITCARD = 0x000b,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_VIEWQUEUE = 0x000c,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_VIEWDOWNLOADDETAILS = 0x000d,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_MEDIAITEM = 0x000e,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_GOLD_UPSELL = 0x000f,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_TERMSOFUSE = 0x0010,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_DIRECT_ACQUIRE = 0x0011,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_PURCHASEPOINTS = 0x0012,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_PAYMENT_OPTIONS = 0x0013,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_BUNDLE_ITEM_DOWNLOAD = 0x0014,
    XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINT_MAX = 0x0015,
} XSHOWMARKETPLACEUI_PRIVATE_ENTRYPOINTS;

typedef struct _MP_BILLING_ACCOUNT_INFO MP_BILLING_ACCOUNT_INFO;

enum GOLD_UPGRADE_REASON {
    GOLD_UPGRADE_REASON_PARTY = 0x0000,
    GOLD_UPGRADE_REASON_OSCAR = 0x0001,
    GOLD_UPGRADE_REASON_VIDEOCHAT = 0x0002,
    GOLD_UPGRADE_REASON_MULTIPLAYER = 0x0003,
    GOLD_UPGRADE_REASON_ADD_PHOTO = 0x0004,
    GOLD_UPGRADE_REASON_PRIMETIME = 0x0005,
    GOLD_UPGRADE_REASON_TITLE_INVOKED = 0x0006,
    GOLD_UPGRADE_REASON_GOLD_TRIAL_EXPIRED = 0x0007,
    GOLD_UPGRADE_REASON_GOLD_SUBSCRIPTION_EXPIRED = 0x0008,
    GOLD_UPGRADE_REASON_MARKETPLACE = 0x0009,
    GOLD_UPGRADE_REASON_EPIX_MARKETING = 0x000a,
    GOLD_UPGRADE_REASON_OTHER = 0x000b,
    GOLD_UPGRADE_REASON_GOLD_SUBSCRIPTION_EXPIRING = 0x000c,
};

typedef struct _XSHOWMARKETPLACEUI_PARAMS { /* Size=0xb8 */
    /* 0x0000 */ DWORD dwTrackingID;
    /* 0x0004 */ DWORD dwUserIndex;
    /* 0x0008 */ ULONGLONG UserXuid;
    /* 0x0010 */ DWORD dwEntryPoint;
    /* 0x0018 */ QWORD qwOfferID;
    /* 0x0020 */ DWORD dwOfferType;
    /* 0x0024 */ DWORD dwContentCategories;
    /* 0x0028 */ unsigned char bRequestFlags;
    /* 0x0030 */ QWORD qwSourceId;
    /* 0x0038 */ DWORD dwTitleId;
    /* 0x003c */ GOLD_UPGRADE_REASON eUpgradeReason;
    /* 0x0040 */ unsigned char bOnlineCountry;
    /* 0x0044 */ _MP_BILLING_ACCOUNT_INFO *pBillingInfo;
    /* 0x0048 */ _XOVERLAPPED *pOverlapped;
    /* 0x004c */ LONG fNuiEnabled;
    /* 0x0050 */ GUID mediaId;
    /* 0x0060 */ DWORD dwMediaType;
    /* 0x0064 */ GUID bundleOfferId;
    /* 0x0078 */ ULONGLONG aullOfferIDs[6];
    /* 0x00a8 */ DWORD dwOfferIdCount;
    /* 0x00ac */ LONG *phrResult;
    /* 0x00b0 */ void *pVoid;
} XSHOWMARKETPLACEUI_PARAMS;

typedef struct _XSHOWDEVICESELECTORUI_PARAMS { /* Size=0x28 */
    /* 0x0000 */ DWORD dwTrackingID;
    /* 0x0004 */ DWORD dwUserIndex;
    /* 0x0008 */ DWORD dwContentType;
    /* 0x000c */ DWORD dwContentFlags;
    /* 0x0010 */ _ULARGE_INTEGER uliBytesRequested;
    /* 0x0018 */ DWORD *pDeviceID;
    /* 0x001c */ _XOVERLAPPED *pOverlapped;
    /* 0x0020 */ BOOL fNuiEnabled;
} XSHOWDEVICESELECTORUI_PARAMS;

#ifdef __cplusplus
}
#endif
